{
  "backend/main.mo": "Defines the backend actor with user profiles, posts, comments, notifications, follow requests, messaging, stories, feature flags, and authorization/storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind-based style sheet defining OKLCH color variables for light and dark themes and base element styling.",
  "frontend/index.html": "Minimal HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up React Query, TanStack Router routes, and access controls for all main pages including admin, messages, settings, and support.",
  "frontend/src/components/admin/FeatureFlagsPanel.tsx": "Admin panel component that loads and toggles feature flags with update mutations and error handling.",
  "frontend/src/components/admin/PostModerationPanel.tsx": "Displays a list of posts for moderators with loading/error states and delete controls for up to 20 posts.",
  "frontend/src/components/admin/SupportIssuesPanel.tsx": "Fetches and displays support issues in a table with status controls, handling loading, errors, and empty states.",
  "frontend/src/components/admin/UserModerationPanel.tsx": "Lets moderators search for a user and perform actions like block, verify, or change roles, with safeguards for admin accounts.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header navigation, content outlet, mobile tab bar, and desktop footer.",
  "frontend/src/components/auth/LoginScreen.tsx": "Renders a login card allowing users to sign in via Internet Identity with a loading state.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps children, showing login or profile setup if needed and handling identity/profile loading states.",
  "frontend/src/components/auth/RequireRole.tsx": "Restricts access to admin/officer users, showing a denial message for others.",
  "frontend/src/components/home/StoriesRow.tsx": "Shows a horizontal row of active stories with avatars, loading placeholders, and a viewer modal.",
  "frontend/src/components/IdeaList.tsx": "Empty file placeholder for the idea list component.",
  "frontend/src/components/IdeaSubmissionForm.tsx": "Empty file placeholder for the idea submission form component.",
  "frontend/src/components/nav/HeaderNav.tsx": "Top navigation bar with links, profile access, notifications, and moderator tools for authenticated users.",
  "frontend/src/components/nav/MobileTabBar.tsx": "Bottom navigation bar for mobile with main tabs and an extra moderation tab for privileged users.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a post with author info, image, like/share/delete actions, and navigation to post or profile pages.",
  "frontend/src/components/posts/PostGrid.tsx": "Renders a grid of posts showing images or captions and navigates to post detail on click.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Modal dialog for editing profile fields, validating input, and submitting updates.",
  "frontend/src/components/profile/FollowButton.tsx": "Follow/unfollow button handling pending states, requests, and error notifications.",
  "frontend/src/components/profile/FollowRequestsPanel.tsx": "Displays incoming follow requests with approve/deny actions and requester details.",
  "frontend/src/components/profile/HighlightsRow.tsx": "Static highlights row UI with placeholder items and a ‘new’ button.",
  "frontend/src/components/profile/MediaControlsPanel.tsx": "Admin panel for toggling global media feature flags like filters and music.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user avatar image with configurable size and fallback.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Form for creating a new user profile with basic fields and validation.",
  "frontend/src/components/profile/SuperAdminManagePanel.tsx": "Admin panel component allowing blocking, unblocking, verifying, unverifying users, and deleting their posts with success/error handling.",
  "frontend/src/components/profile/VerifiedBadge.tsx": "Renders a checkmark badge, styled differently for admins versus regular verified users.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Dialog for uploading and previewing an image story with validation and submission to the createStory hook.",
  "frontend/src/components/stories/StoryViewer.tsx": "Full‑screen dialog for viewing a story image with a close button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminModeration.ts": "Provides mutations for blocking, unblocking, verifying, unverifying, and role‑changing users, invalidating profile queries.",
  "frontend/src/hooks/useAppIdeas.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useFeatureFlags.ts": "Queries and updates backend feature flags using the actor, with cache invalidation.",
  "frontend/src/hooks/useFollowRequests.ts": "Manages pending follow requests and approval/denial actions, updating related caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, state management, and identity persistence.",
  "frontend/src/hooks/useMessages.ts": "Hooks for conversations and messaging, including fetching conversations, messages, creating conversations, and sending messages.",
  "frontend/src/hooks/useNotifications.ts": "Provides hooks to fetch notifications and mark them as read using react-query and actor calls.",
  "frontend/src/hooks/usePosts.ts": "Defines hooks for fetching, creating, deleting, liking, and unliking posts, with query invalidation for feed updates.",
  "frontend/src/hooks/useProfiles.ts": "Implements profile-related hooks to fetch, create, and update user profiles via actor methods.",
  "frontend/src/hooks/useSocialGraph.ts": "Contains hooks for retrieving followers/following lists and performing follow/unfollow actions.",
  "frontend/src/hooks/useStories.ts": "Provides hooks to fetch active stories, get a story by ID, and create new stories with image blobs.",
  "frontend/src/hooks/useSupport.ts": "Defines hooks for submitting, fetching, and updating support issues through actor APIs.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and defines light/dark theme design tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPortalPage.tsx": "Renders an admin portal with tabs for moderating users, posts, features, and support issues.",
  "frontend/src/pages/ConversationPage.tsx": "Implements a messaging view that loads a conversation, displays messages, and allows sending new ones.",
  "frontend/src/pages/CreatePostPage.tsx": "Form page that lets users create a post with caption and optional image, handles validation, upload, and restricted accounts.",
  "frontend/src/pages/ExplorePage.tsx": "Explore page providing user search and a grid of recent posts.",
  "frontend/src/pages/HomeFeedPage.tsx": "Loads and displays the user's home feed with stories, posts, and empty/error states.",
  "frontend/src/pages/MessagesPage.tsx": "Shows the user's conversations list with loading/empty states and navigation to individual chats.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays notifications and pending follow requests, allowing marking notifications as read.",
  "frontend/src/pages/PostDetailPage.tsx": "Detail view for a single post with image, likes, comments, and share functionality.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user's profile, visibility rules, posts, and actions like follow, message, and edit.",
  "frontend/src/pages/SettingsPage.tsx": "Renders the settings page with logout handling and a link to the support page.",
  "frontend/src/pages/SupportPage.tsx": "Implements a support issue submission form with category selection, validation, and success/error alerts.",
  "frontend/src/utils/postImage.ts": "Provides utilities to convert image data to blob URLs, revoke them, and convert File objects to Uint8Array.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Describes the project's current state, features, issues, and requirements for continuing Instabook development."
}