{
  "backend/main.mo": "Defines the main actor with storage mixins, authorization, and comprehensive types for users, posts, comments, stories, notifications, conversations, and support issues.",
  "backend/migration.mo": "Provides type definitions and structures for migrating state between old and new actor versions, including posts, profiles, notifications, and stories.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend components, hooks, and config files used across the app.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color variables for light and dark themes with global styling.",
  "frontend/index.html": "Minimal HTML shell that loads the React app entry point into a root div.",
  "frontend/src/App.tsx": "Sets up the React Query client and TanStack Router with authenticated and role‑restricted routes for core app pages.",
  "frontend/src/components/admin/FeatureFlagsPanel.tsx": "Admin panel to view and toggle feature flags such as filters and music using backend hooks.",
  "frontend/src/components/admin/PostModerationPanel.tsx": "Displays all posts for admin review and allows deleting posts with author info and images.",
  "frontend/src/components/admin/SupportIssuesPanel.tsx": "Placeholder panel stating support issue management is unavailable due to missing backend methods.",
  "frontend/src/components/admin/UserModerationPanel.tsx": "Admin tool to search users and modify their verification status with role-based restrictions.",
  "frontend/src/components/AppLayout.tsx": "Defines the main app layout with header, outlet content, mobile tab bar, and footer displaying version info.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen allowing users to sign in via Internet Identity.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper component enforcing authentication, handling profile loading, errors, and setup flow.",
  "frontend/src/components/auth/RequireRole.tsx": "Protects routes by checking user role (admin or officer) and shows appropriate error or redirect options.",
  "frontend/src/components/home/StoriesRow.tsx": "Renders a horizontal stories row with story creation, loading skeletons, and story viewer integration.",
  "frontend/src/components/IdeaList.tsx": "Empty file with no implementation.",
  "frontend/src/components/IdeaSubmissionForm.tsx": "Empty file with no implementation.",
  "frontend/src/components/nav/HeaderNav.tsx": "Top navigation bar showing links, notifications, and profile or settings access based on user data and role.",
  "frontend/src/components/nav/MobileTabBar.tsx": "Mobile bottom tab bar with navigation icons, conditional moderation tab, and profile/settings routing.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a single post with author info, image, likes, comments, share actions, and optional delete.",
  "frontend/src/components/posts/PostGrid.tsx": "Renders a grid of post thumbnails that navigate to the post detail page when clicked.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Modal dialog for editing profile fields, validating input, and submitting updates with success/error handling.",
  "frontend/src/components/profile/FollowButton.tsx": "Follow/unfollow button handling requests, pending states, and approval-required flows.",
  "frontend/src/components/profile/FollowRequestsPanel.tsx": "Panel listing incoming follow requests with approve/deny actions and requester info.",
  "frontend/src/components/profile/HighlightsRow.tsx": "Static highlights row UI with placeholder items and an option to add a new highlight.",
  "frontend/src/components/profile/MediaControlsPanel.tsx": "UI panel allowing admins to toggle global filters and music feature flags with loading and error states.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user avatar with size options and a fallback default image.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog form for creating a new user profile with validation and error handling.",
  "frontend/src/components/profile/SuperAdminManagePanel.tsx": "Super-admin panel to grant or remove verification badges, with admin restrictions and status alerts.",
  "frontend/src/components/profile/VerifiedBadge.tsx": "SVG verified badge component with selectable color variants.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Dialog for uploading and previewing an image story with validation and mutation handling.",
  "frontend/src/components/stories/StoryViewer.tsx": "Story viewer modal showing the story image, author info, and like/unlike controls.",
  "frontend/src/constants/appVersion.ts": "Exports the application version constant.",
  "frontend/src/constants/superAdmin.ts": "Defines the super-admin principal and a helper to check if a principal matches it.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity, invalidating dependent queries when changed.",
  "frontend/src/hooks/useAdminModeration.ts": "Mutation hook for setting a user's verified status and refreshing profile data.",
  "frontend/src/hooks/useAppIdeas.ts": "Empty placeholder file.",
  "frontend/src/hooks/useBackendErrorToast.ts": "Provides a hook for showing formatted backend errors or success messages via toast notifications.",
  "frontend/src/hooks/useCallerRole.ts": "Determines the user’s effective role using identity, admin checks, and profile data with caching and fallback logic.",
  "frontend/src/hooks/useFeatureFlags.ts": "Stub hooks for feature flags that return defaults and throw on update due to missing backend support.",
  "frontend/src/hooks/useFollowRequests.ts": "Stub hooks for follow-request operations that return empty data and throw on mutations until backend is implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, persistence, and context access via an authentication provider.",
  "frontend/src/hooks/useMessages.ts": "Implements conversation and messaging queries and mutations, including fetching conversations, messages, and sending messages.",
  "frontend/src/hooks/useNotifications.ts": "Stub hooks for notifications that return empty data and throw on mutation due to missing backend methods.",
  "frontend/src/hooks/usePosts.ts": "Provides hooks for fetching, creating, and deleting posts using the backend actor with error formatting and cache invalidation.",
  "frontend/src/hooks/useProfiles.ts": "Implements profile queries and mutations for fetching and updating user profiles with error handling and cache refresh.",
  "frontend/src/hooks/useSocialGraph.ts": "Stub social-graph hooks for followers and following that return empty data and throw on follow/unfollow actions until backend exists.",
  "frontend/src/hooks/useStories.ts": "React-query hooks for fetching, creating, and liking stories via the backend actor with query invalidation.",
  "frontend/src/hooks/useSupport.ts": "Placeholder hooks for support issue operations; all backend methods are missing so they return empty data or errors.",
  "frontend/src/index.css": "Tailwind base/style setup defining CSS variables for light and dark themes and global styling.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminPortalPage.tsx": "Admin page providing tabs for user moderation, post moderation, feature flags, and support issues.",
  "frontend/src/pages/ConversationPage.tsx": "Messaging UI that initializes conversations, displays messages, and allows sending new messages with error handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Form page for creating posts with caption and optional image upload, including validation and preview.",
  "frontend/src/pages/ExplorePage.tsx": "Explore page enabling username search and displaying recent posts and user info.",
  "frontend/src/pages/HomeFeedPage.tsx": "Home feed showing stories, posts, loading states, errors, and empty feed UI.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a list of conversations, handling loading, empty state, and navigation to individual message threads.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows notifications and pending follow requests with read-status handling and error/loading states.",
  "frontend/src/pages/PostDetailPage.tsx": "Renders a single post with likes, comments, sharing, and author info, including loading and not-found handling.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user's profile, posts, and follow state with support for editing, messaging, and permission logic.",
  "frontend/src/pages/SettingsPage.tsx": "Provides account settings including logout, support navigation, and app version info.",
  "frontend/src/pages/SupportPage.tsx": "Shows a support form UI, but submission is disabled due to missing backend functionality.",
  "frontend/src/types/missing-backend-types.ts": "Defines TypeScript types for unimplemented backend features such as posts, comments, notifications, and support issues.",
  "frontend/src/utils/formatBackendError.ts": "Maps backend and IC agent error messages to short user-friendly strings, with fallbacks for unknown formats.",
  "frontend/src/utils/postImage.ts": "Provides helpers to convert image byte data to blob URLs, revoke them, and convert File objects into Uint8Array for uploads.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin setup for the frontend.",
  "project_state.json": "JSON file tracking project state, requirements, architecture notes, and known issues for the Instabook app."
}