{
  "backend/main.mo": "Defines the actor’s data models for users, posts, stories, messages, notifications, support issues, follow graph, and includes authorization and blob‑storage mixins.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests for a build‑retry and deployment‑fix feature.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing styles, components, navigation, and auth flows.",
  "frontend/index.css": "Defines global CSS variables, light/dark theme tokens, and Tailwind base styling overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up React Query, TanStack Router routes, auth guards, role checks, and an error fallback UI.",
  "frontend/src/components/admin/FeatureFlagsPanel.tsx": "Admin UI for viewing and updating feature flags with loading, error, and save handling.",
  "frontend/src/components/admin/PostModerationPanel.tsx": "Displays all posts for admins with author info, thumbnails, timestamps, and allows deleting posts.",
  "frontend/src/components/admin/SupportIssuesPanel.tsx": "Shows user-submitted support issues with metadata and lets admins update each issue’s status.",
  "frontend/src/components/admin/UserModerationPanel.tsx": "Provides admin tools to search users and manage verification, blocking, and role promotion/demotion.",
  "frontend/src/components/AppLayout.tsx": "Provides the main app layout with header, routed content, mobile tab bar, and footer.",
  "frontend/src/components/auth/LoginScreen.tsx": "Simple login screen allowing users to sign in via Internet Identity.",
  "frontend/src/components/auth/RequireAuth.tsx": "Gatekeeper component that handles authentication, profile loading, timeouts, and forces setup when needed.",
  "frontend/src/components/auth/RequireRole.tsx": "Restricts access based on admin or officer roles and shows appropriate error or redirect options.",
  "frontend/src/components/home/StoriesRow.tsx": "Renders horizontal list of active user stories with avatars, loading skeletons, and viewer integration.",
  "frontend/src/components/IdeaList.tsx": "Placeholder component showing a stub message for future idea listing.",
  "frontend/src/components/IdeaSubmissionForm.tsx": "Placeholder component showing a stub form message for future idea submissions.",
  "frontend/src/components/layout/PageHeader.tsx": "Reusable layout header showing a page title, optional description, and optional action buttons.",
  "frontend/src/components/nav/HeaderNav.tsx": "Top navigation header with links, notifications badge, profile avatar, and conditional moderation link based on user roles.",
  "frontend/src/components/nav/MobileTabBar.tsx": "Mobile bottom navigation bar with main app routes, profile navigation logic, and optional moderation tab.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a single post with author info, image loading states, interactions, and optional delete functionality.",
  "frontend/src/components/posts/PostGrid.tsx": "Renders a grid of posts with image loading states and click-through navigation to individual posts.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Dialog for editing profile details with form validation, update mutation, and success/error handling.",
  "frontend/src/components/profile/FollowButton.tsx": "Follow/unfollow button handling state, pending requests, and mutations with toast notifications.",
  "frontend/src/components/profile/FollowRequestsPanel.tsx": "Panel listing incoming follow requests with approve/deny actions and requester profile info.",
  "frontend/src/components/profile/HighlightsRow.tsx": "Renders a horizontal scroll area with a button to add a new highlight and placeholder highlight items.",
  "frontend/src/components/profile/MediaControlsPanel.tsx": "Displays feature flag switches for filters and music, handling loading, errors, and updates.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Shows a profile avatar image with size options and a fallback default image.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Provides a form for creating a user profile with validation and error handling.",
  "frontend/src/components/profile/SuperAdminManagePanel.tsx": "Allows super admins to grant or remove blue verification badges for a user.",
  "frontend/src/components/profile/VerifiedBadge.tsx": "Displays an SVG verification badge in different color variants.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Dialog for creating a story by uploading an image with validation, preview, and submission.",
  "frontend/src/components/stories/StoryViewer.tsx": "Shows a full-screen story viewer with author info, image display, and like/unlike actions.",
  "frontend/src/constants/appVersion.ts": "Defines the application version constant.",
  "frontend/src/constants/superAdmin.ts": "Defines the super-admin principal and helper to check if a principal is super-admin.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, refreshing dependent queries on change.",
  "frontend/src/hooks/useActorInitTimeout.ts": "Tracks whether actor initialization exceeds 15 seconds by monitoring isFetching.",
  "frontend/src/hooks/useAdminModeration.ts": "Provides a mutation to update a user's verification state and invalidates related profile queries.",
  "frontend/src/hooks/useAppIdeas.ts": "Placeholder hooks returning static data and errors for unimplemented app-idea features.",
  "frontend/src/hooks/useBackendErrorToast.ts": "Wraps toast notifications to show formatted backend errors or success messages.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller's effective role based on identity, actor, and backend user role.",
  "frontend/src/hooks/useFeatureFlags.ts": "Gets and updates feature flags via actor calls with query invalidation.",
  "frontend/src/hooks/useFollowRequests.ts": "Stub hooks for follow-request features, currently returning empty data and throwing unimplemented errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth lifecycle, exposing identity, login, logout, and status via context.",
  "frontend/src/hooks/useMessages.ts": "Defines messaging hooks that depend on missing backend methods and currently throw errors or return empty results.",
  "frontend/src/hooks/useNotifications.ts": "Stub notification hooks returning empty data and throwing errors due to missing backend support.",
  "frontend/src/hooks/usePostImageSrc.ts": "Converts ExternalBlob images into safe display URLs with validation, fallback, and cleanup.",
  "frontend/src/hooks/usePosts.ts": "Provides post-related queries and mutations such as fetching feeds, user posts, and creating posts via the actor.",
  "frontend/src/hooks/useProfiles.ts": "Provides React Query hooks for fetching and mutating user profile data, with several mutations stubbed due to missing backend methods.",
  "frontend/src/hooks/useSocialGraph.ts": "Implements hooks for follower/following operations, but all backend calls are placeholders that throw errors.",
  "frontend/src/hooks/useStories.ts": "Contains hooks for story retrieval, creation, and likes, integrating with backend story APIs and invalidating queries on updates.",
  "frontend/src/hooks/useSupport.ts": "Offers hooks for submitting, retrieving, and updating support issues using backend support APIs.",
  "frontend/src/hooks/useThemePreference.ts": "Manages light/dark theme preference using localStorage and synchronizes theme changes across tabs.",
  "frontend/src/hooks/useUserModerationActions.ts": "Provides hooks for user moderation actions like blocking, unblocking, and role changes, invalidating related queries after mutations.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes, gradients, animations, and admin styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPortalPage.tsx": "Renders an admin portal with tabs for user moderation, post moderation, feature flags, and support issues. Provides a styled layout with tabbed navigation displaying the respective panels.",
  "frontend/src/pages/ConversationPage.tsx": "Handles viewing and sending messages in a conversation, including initializing conversations, loading messages, error handling, and auto-scrolling. Uses profile lookup, message hooks, and renders a chat UI.",
  "frontend/src/pages/CreatePostPage.tsx": "Provides a form to create a post with caption and optional image upload, including validation, previews, and blocked-user restrictions. Submits new posts through a createPost hook and handles errors.",
  "frontend/src/pages/ExplorePage.tsx": "Implements a search interface for finding users and displays recent posts. Fetches user profiles and post data and renders results with navigation to profiles.",
  "frontend/src/pages/FollowersFollowingPage.tsx": "Displays either followers or following for a given user, handling loading, errors, and navigation to user profiles. Fetches the appropriate list based on route parameters.",
  "frontend/src/pages/HomeFeedPage.tsx": "Shows the user’s home feed with stories, posts, and error/loading states. Uses the home feed hook to fetch posts and supports retry on failure.",
  "frontend/src/pages/MessagesPage.tsx": "Renders the conversations list with loading/empty states and navigates to individual message threads.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays notifications, unread counts, follow requests, and supports marking items as read with error handling.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows a single post with author info, image, comments, and supports adding new comments.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user's profile, posts, follower data, and provides messaging, follow, and edit options.",
  "frontend/src/pages/SettingsPage.tsx": "Provides appearance settings, logout functionality, and account/support options.",
  "frontend/src/pages/SupportPage.tsx": "Lets users submit categorized support requests with validation and success/error feedback.",
  "frontend/src/types/backend-actor-augmentations.d.ts": "Augments the backend actor type with a method for initializing access control using an admin secret.",
  "frontend/src/types/missing-backend-types.ts": "Defines TypeScript placeholders for backend types plus interfaces for comments, follow requests, notifications, conversations, and messages.",
  "frontend/src/utils/formatBackendError.ts": "Maps various backend, network, and initialization error messages to user-friendly English strings.",
  "frontend/src/utils/postImage.ts": "Provides helpers to convert binary image data to blob URLs, revoke them, and convert File objects to Uint8Array.",
  "frontend/src/utils/urlParams.ts": "Extracts query-string parameters from the browser URL for setup or secret values.",
  "frontend/src/utils/verifiedBadge.ts": "Determines which verification badge color to show based on user role and verification state.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, breakpoints, shadows, and plugins for the frontend.",
  "project_state.json": "Describes the current project state, requirements, architecture notes, and unresolved issues for the Instabook app."
}