{
  "backend/main.mo": "Defines data types and in‑memory maps for users, posts, comments, notifications, and conversations with mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests related to adding an app version constant and displaying it in the UI.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend component purposes, routing, styling, and admin tools.",
  "frontend/index.css": "Tailwind base/style variables defining OKLCH color themes, dark mode tokens, and global styling.",
  "frontend/index.html": "Basic HTML root document loading the React application entry point.",
  "frontend/src/App.tsx": "Sets up React Query and TanStack Router with authenticated routes for main app pages and admin tools.",
  "frontend/src/components/admin/FeatureFlagsPanel.tsx": "Admin panel allowing toggling of feature flags with loading, error, and success handling.",
  "frontend/src/components/admin/PostModerationPanel.tsx": "Admin interface for listing and deleting posts with loading and error states.",
  "frontend/src/components/admin/SupportIssuesPanel.tsx": "Stub panel indicating support issue management is unavailable due to missing backend methods.",
  "frontend/src/components/admin/UserModerationPanel.tsx": "Provides an interface for searching users and toggling their verification status, with restrictions on moderating admin accounts.",
  "frontend/src/components/AppLayout.tsx": "Root layout rendering header, outlet, mobile navigation, and footer with version display.",
  "frontend/src/components/auth/LoginScreen.tsx": "Displays a login card allowing users to sign in via Internet Identity, showing loading state during authentication.",
  "frontend/src/components/auth/RequireAuth.tsx": "Guards routes by requiring authentication and profile setup, showing loading or login screens when needed.",
  "frontend/src/components/auth/RequireRole.tsx": "Restricts access to admin/officer roles and shows an access‑denied message for unauthorized users.",
  "frontend/src/components/home/StoriesRow.tsx": "Renders a horizontal stories list with a create option and individual story viewers, loading placeholders when fetching.",
  "frontend/src/components/IdeaList.tsx": "Empty file placeholder for an idea list component.",
  "frontend/src/components/IdeaSubmissionForm.tsx": "Empty file placeholder for an idea submission form component.",
  "frontend/src/components/nav/HeaderNav.tsx": "Displays the main navigation bar with links, notifications, and admin tools based on user role and authentication.",
  "frontend/src/components/nav/MobileTabBar.tsx": "Shows a mobile bottom tab bar for navigation, adding a moderation tab for admin/officer users.",
  "frontend/src/components/posts/PostCard.tsx": "Renders a full post card with author info, image, likes, comments, sharing, and optional deletion.",
  "frontend/src/components/posts/PostGrid.tsx": "Displays posts in a clickable grid layout, navigating to individual post pages on selection.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Modal dialog allowing users to edit profile fields and submit updates, with validation and success/error handling.",
  "frontend/src/components/profile/FollowButton.tsx": "Button that toggles between follow, unfollow, or request states using social graph mutations and loading indicators.",
  "frontend/src/components/profile/FollowRequestsPanel.tsx": "Panel listing pending follow requests with approve/deny actions and requester profile info.",
  "frontend/src/components/profile/HighlightsRow.tsx": "A horizontal scrollable row showing placeholder highlight circles and an option to add a new one.",
  "frontend/src/components/profile/MediaControlsPanel.tsx": "Admin panel to view and toggle global feature flags for filters and music with loading and error states.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Profile avatar component rendering a user image at various sizes with a default fallback.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Profile creation form collecting username, display name, email, and bio with validation and submission handling.",
  "frontend/src/components/profile/SuperAdminManagePanel.tsx": "Super admin panel for giving or removing verification badges with error/success feedback and admin restrictions.",
  "frontend/src/components/profile/VerifiedBadge.tsx": "Renders a check-circle badge with optional orange styling for verified users.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Component for uploading and previewing an image to create a story, including validation and mutation submission.",
  "frontend/src/components/stories/StoryViewer.tsx": "Displays a fullscreen story viewer with like functionality, error handling, and close controls.",
  "frontend/src/constants/appVersion.ts": "Exports the application version constant.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useAdminModeration.ts": "Provides a mutation to set a user's verified status, noting other moderation functions are missing.",
  "frontend/src/hooks/useAppIdeas.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useFeatureFlags.ts": "Returns static feature flag values and a mutation stub that throws due to missing backend methods.",
  "frontend/src/hooks/useFollowRequests.ts": "Provides placeholder hooks for follow request fetching and actions, all disabled or throwing due to missing backend methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, logout, and identity restoration.",
  "frontend/src/hooks/useMessages.ts": "Hooks for conversations and messages, including fetching, sending messages, and creating conversations.",
  "frontend/src/hooks/useNotifications.ts": "Placeholder hooks for notifications that return empty data or throw due to missing backend methods.",
  "frontend/src/hooks/usePosts.ts": "React Query hooks for posts with all backend methods stubbed out and disabled, returning empty data or errors.",
  "frontend/src/hooks/useProfiles.ts": "Profile fetch and mutation hooks using the actor API to load and update user profiles with query invalidation.",
  "frontend/src/hooks/useSocialGraph.ts": "Social graph hooks for followers and following; backend methods are missing so queries are disabled and mutations throw errors.",
  "frontend/src/hooks/useStories.ts": "Story hooks with only like/unlike implemented via actor; fetching and creation are disabled due to missing backend methods.",
  "frontend/src/hooks/useSupport.ts": "Support issue hooks with submission, listing, and status update stubs that return empty data or errors.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and applying global styles.",
  "frontend/src/main.tsx": "Application entry point configuring React Query, Internet Identity provider, and rendering the App component.",
  "frontend/src/pages/AdminPortalPage.tsx": "Admin portal UI with tabbed panels for user moderation, posts, feature flags, and support issues.",
  "frontend/src/pages/ConversationPage.tsx": "Messaging page that loads a peer profile, initializes a conversation, shows messages, and allows sending new ones.",
  "frontend/src/pages/CreatePostPage.tsx": "Form page to create a post with caption, optional image upload/preview, validation, and submission via useCreatePost; blocks posting if the user is restricted.",
  "frontend/src/pages/ExplorePage.tsx": "Explore page providing user search by username and showing recent posts using PostGrid.",
  "frontend/src/pages/HomeFeedPage.tsx": "Displays the home feed with loading/error states, a Stories row, and a list of posts.",
  "frontend/src/pages/MessagesPage.tsx": "Lists user conversations with loading/empty states and supports navigation to individual message threads.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows notifications and pending follow requests with marking-as-read functionality and scrollable list.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a single post with image, likes, comments, and actions such as liking, sharing, and commenting.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page showing user info, posts, follow state, privacy handling, and admin/owner controls.",
  "frontend/src/pages/SettingsPage.tsx": "Renders the settings page with logout, support navigation, and app version display; clears identity and query cache on logout.",
  "frontend/src/pages/SupportPage.tsx": "Implements a support form UI with category and description fields but only shows errors since backend submission is not implemented.",
  "frontend/src/types/missing-backend-types.ts": "Defines TypeScript interfaces and enums mirroring unimplemented backend types for posts, comments, stories, notifications, and support issues.",
  "frontend/src/utils/postImage.ts": "Provides helpers to convert binary image data to blob URLs, revoke URLs, and convert files to Uint8Array for uploads.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings using plugins.",
  "project_state.json": "Tracks project state, requirements, architecture notes, known issues, and feature definitions for the Instabook app."
}