{
  "backend/main.mo": "Defines the backend actor with user profiles, posts, comments, stories, notifications, conversations, feature flags, and follow graph types plus storage and authorization mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptive summaries for many frontend files to assist with build planning and understanding project structure.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens, dark mode variables, and base styling.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up React Query, TanStack Router routes, auth/role guards, and a user‑friendly error fallback UI.",
  "frontend/src/components/admin/FeatureFlagsPanel.tsx": "Admin panel UI for viewing and toggling feature flags with backend updates and error handling.",
  "frontend/src/components/admin/PostModerationPanel.tsx": "Displays all posts for admins with loading/error states and allows deleting posts; each post item shows author and image preview.",
  "frontend/src/components/admin/SupportIssuesPanel.tsx": "Shows support issues with creator info and lets admins update issue statuses; includes category labels and status icons.",
  "frontend/src/components/admin/UserModerationPanel.tsx": "Allows searching users and performing moderation actions like verification changes, blocking, and role adjustments with error handling.",
  "frontend/src/components/AppLayout.tsx": "Layout component rendering header, content outlet, mobile tab bar, and footer with version info.",
  "frontend/src/components/auth/LoginScreen.tsx": "Provides a login UI using Internet Identity with a simple sign‑in button and branding.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content, handling authentication, profile loading, timeouts, and showing setup or error screens when needed.",
  "frontend/src/components/auth/RequireRole.tsx": "Restricts access based on caller role, showing loading, error, or access‑denied states before rendering children.",
  "frontend/src/components/home/StoriesRow.tsx": "Renders a horizontal list of active stories with avatars and a viewer, including a create‑story control and loading placeholders.",
  "frontend/src/components/IdeaList.tsx": "Placeholder component showing a stubbed ideas list message.",
  "frontend/src/components/IdeaSubmissionForm.tsx": "Placeholder component displaying a stubbed idea submission form.",
  "frontend/src/components/layout/PageHeader.tsx": "Simple header component showing a title, optional description, and optional action elements.",
  "frontend/src/components/nav/HeaderNav.tsx": "Top navigation bar showing links, notifications, settings, and the user avatar with role‑based admin access.",
  "frontend/src/components/nav/MobileTabBar.tsx": "Mobile bottom tab bar with navigation icons and profile routing, including optional moderation tab for officers.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a full post card with author info, image loading states, like/share UI, and optional delete handling.",
  "frontend/src/components/posts/PostGrid.tsx": "Renders a responsive grid of posts with image loading states and navigation to individual post pages.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Modal dialog allowing users to edit profile fields, handle validation, and submit updates with success/error feedback.",
  "frontend/src/components/profile/FollowButton.tsx": "Follow/unfollow button managing follow state, pending requests, and mutation feedback.",
  "frontend/src/components/profile/FollowRequestsPanel.tsx": "Panel listing incoming follow requests with approve/deny actions and requester profile info.",
  "frontend/src/components/profile/HighlightsRow.tsx": "Static highlights row UI with a 'new' button and placeholder highlight circles.",
  "frontend/src/components/profile/MediaControlsPanel.tsx": "Admin panel for viewing and toggling global media-related feature flags like filters and music.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user avatar with size options and a fallback image.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Form dialog for creating a new user profile with basic fields and error handling.",
  "frontend/src/components/profile/SuperAdminManagePanel.tsx": "Super-admin panel to manage a user's verification status, preventing changes to admin accounts.",
  "frontend/src/components/profile/VerifiedBadge.tsx": "SVG component rendering a colored verified badge icon with selectable variants.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Dialog for uploading and previewing an image to create a new story with validation.",
  "frontend/src/components/stories/StoryViewer.tsx": "Viewer dialog to display a story image, show author info, and like or unlike the story.",
  "frontend/src/constants/appVersion.ts": "Exports the application's version constant.",
  "frontend/src/constants/superAdmin.ts": "Defines the super-admin principal and helpers for checking super-admin identity.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and returns a backend actor based on authentication state and manages query invalidation.",
  "frontend/src/hooks/useActorInitTimeout.ts": "Tracks if actor fetching exceeds 15 seconds and returns a timeout flag.",
  "frontend/src/hooks/useAdminModeration.ts": "Provides a mutation for setting user verification state, but backend method is not yet implemented.",
  "frontend/src/hooks/useAppIdeas.ts": "Placeholder hooks for app ideas and submissions, currently returning static data or errors.",
  "frontend/src/hooks/useBackendErrorToast.ts": "Displays formatted backend errors or success messages using toast notifications.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller’s effective role based on identity, super-admin check, and backend role lookup.",
  "frontend/src/hooks/useFeatureFlags.ts": "Fetches and updates feature flags via actor calls, invalidating cache on update.",
  "frontend/src/hooks/useFollowRequests.ts": "Stub hooks for follow request operations; backend methods are missing so they return empty data or errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and stored identity loading.",
  "frontend/src/hooks/useMessages.ts": "Stub messaging hooks for conversations and messages; backend methods are unavailable so they throw errors or return empty lists.",
  "frontend/src/hooks/useNotifications.ts": "Stub hooks for notifications; returns empty data and errors since backend methods are missing.",
  "frontend/src/hooks/usePostImageSrc.ts": "Builds a safe image src from an ExternalBlob, validating direct URLs or falling back to Blob creation.",
  "frontend/src/hooks/usePosts.ts": "Various post-related hooks that rely on unimplemented backend methods, providing errors or empty results.",
  "frontend/src/hooks/useProfiles.ts": "React Query hooks for fetching and mutating user profiles, with most mutation methods stubbed due to missing backend endpoints.",
  "frontend/src/hooks/useSocialGraph.ts": "Hooks for followers/following and follow actions, all currently throwing errors because backend methods are not implemented.",
  "frontend/src/hooks/useStories.ts": "Story-related query and mutation hooks, largely stubbed out with errors for missing backend story methods.",
  "frontend/src/hooks/useSupport.ts": "Support issue submission and retrieval hooks that currently error due to missing backend support endpoints.",
  "frontend/src/hooks/useThemePreference.ts": "Manages light/dark theme preference with localStorage syncing and DOM class updates.",
  "frontend/src/hooks/useUserModerationActions.ts": "User moderation hooks for blocking, unblocking, and role changes, calling actual actor methods and invalidating queries.",
  "frontend/src/index.css": "Tailwind-based global styling with light/dark color palettes, admin accent colors, and animation utilities.",
  "frontend/src/main.tsx": "App entrypoint that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminPortalPage.tsx": "Admin portal page with tabbed panels for user, post, feature, and support moderation.",
  "frontend/src/pages/ConversationPage.tsx": "Initializes or loads a conversation with a peer, displays messages, and allows sending new ones with auto‑scroll and error handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Provides a form to create a post with caption and optional image upload, including validation, preview, and submission logic.",
  "frontend/src/pages/ExplorePage.tsx": "Lets users search for profiles and displays recent posts, showing search results and a grid of latest content.",
  "frontend/src/pages/FollowersFollowingPage.tsx": "Displays either followers or following for a user, fetching profile and social graph data and allowing navigation to other profiles.",
  "frontend/src/pages/HomeFeedPage.tsx": "Shows the user's home feed with stories, posts, loading states, and error handling.",
  "frontend/src/pages/MessagesPage.tsx": "Lists user conversations with peers, showing recent messages and unread counts, and links to individual conversation threads.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays notifications and follow requests, handles loading/errors, and marks notifications as read.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows a single post with author info, image, comments, and supports adding new comments.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile with posts, followers, role-based UI, and follow/edit actions.",
  "frontend/src/pages/SettingsPage.tsx": "Provides settings for appearance, account actions like logout, support access, and app info.",
  "frontend/src/pages/SupportPage.tsx": "Lets users submit support issues with category and description, handling validation and submission.",
  "frontend/src/types/missing-backend-types.ts": "Defines TypeScript types for posts, comments, stories, notifications, support issues, and messaging based on backend structures.",
  "frontend/src/utils/formatBackendError.ts": "Maps various backend and IC agent error messages to user-friendly strings, falling back to the raw message or a generic error.",
  "frontend/src/utils/postImage.ts": "Provides helpers to convert image byte data to blob URLs, revoke them, and convert File objects to Uint8Array for uploads.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored or hash-based parameters.",
  "frontend/src/utils/verifiedBadge.ts": "Determines which verified badge color to show based on user profile role and verification state.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugins for the frontend build.",
  "project_state.json": "Tracks project version, current goals, architecture notes, known issues, and existing features for the Instabook app."
}