{
  "backend/main.mo": "Defines the main canister actor with user profiles, posts, comments, notifications, messaging, stories, feature flags, and authorization/storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files for reference in build planning.",
  "frontend/index.css": "Sets global CSS variables for light/dark themes and applies Tailwind base styles.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures React Query and TanStack Router routes with auth guards and a global error fallback.",
  "frontend/src/components/admin/FeatureFlagsPanel.tsx": "Admin UI panel to view and update feature flags with loading, error, and success handling.",
  "frontend/src/components/admin/PostModerationPanel.tsx": "Displays a list of posts for admins to review, showing author info, thumbnails, and allowing post deletion. Handles loading, image fallback, and error states.",
  "frontend/src/components/admin/SupportIssuesPanel.tsx": "Shows support issues with creator info, category labels, and status controls. Allows admins to update issue status with feedback and error handling.",
  "frontend/src/components/admin/UserModerationPanel.tsx": "Provides tools to search users and modify verification, blocking, and role status. Includes validation, error handling, and admin restrictions.",
  "frontend/src/components/AppLayout.tsx": "Defines page layout with header, footer, main content outlet, and mobile tab bar.",
  "frontend/src/components/auth/LoginScreen.tsx": "Renders a login page with an Internet Identity sign‑in button and loading state. Displays app branding and simple authentication UI.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected routes, handling authentication, profile loading, timeouts, and profile setup. Shows appropriate fallback screens for errors or missing profiles.",
  "frontend/src/components/auth/RequireRole.tsx": "Guards routes based on required user role, showing loading, error, or access‑denied states. Redirects unauthorized users to home.",
  "frontend/src/components/home/StoriesRow.tsx": "Shows a horizontal scroll row of stories with avatars, loading placeholders, and a viewer dialog. Fetches active stories and opens them on click.",
  "frontend/src/components/IdeaList.tsx": "Placeholder component showing a stub ideas list message.",
  "frontend/src/components/IdeaSubmissionForm.tsx": "Placeholder form component showing a stub idea submission message.",
  "frontend/src/components/layout/PageHeader.tsx": "Displays a page title, optional description, and optional action buttons in a header layout.",
  "frontend/src/components/nav/HeaderNav.tsx": "Top navigation bar showing links, notifications, settings, and user avatar with role-based admin link.",
  "frontend/src/components/nav/MobileTabBar.tsx": "Mobile bottom tab bar providing quick navigation and role-based admin access with profile button.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a full post with author info, image handling, likes, comments, sharing, and optional deletion.",
  "frontend/src/components/posts/PostGrid.tsx": "Renders a grid of posts with image thumbnails and navigation to individual posts.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Modal form allowing users to edit profile fields, validate input, and submit updates.",
  "frontend/src/components/profile/FollowButton.tsx": "Follow/unfollow button managing follow state, pending requests, and mutation actions.",
  "frontend/src/components/profile/FollowRequestsPanel.tsx": "Panel listing pending follow requests with approve and deny actions.",
  "frontend/src/components/profile/HighlightsRow.tsx": "Static highlights row with a new highlight button and placeholder highlight items.",
  "frontend/src/components/profile/MediaControlsPanel.tsx": "Panel to view and toggle global media feature flags, with loading and error states and mutation handling.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user avatar with size variants and a fallback image.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog for creating a user profile with form fields, validation, and error handling.",
  "frontend/src/components/profile/SuperAdminManagePanel.tsx": "Admin panel to manage a user's verification state with restrictions for admin roles.",
  "frontend/src/components/profile/VerifiedBadge.tsx": "SVG verified badge component supporting color variants.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Dialog for uploading and previewing an image to create a story with validation and mutation.",
  "frontend/src/components/stories/StoryViewer.tsx": "Story viewing dialog showing the image, author info, and like interactions with error handling.",
  "frontend/src/constants/appVersion.ts": "Exports the current application version constant.",
  "frontend/src/constants/superAdmin.ts": "Defines the super-admin principal and helper function to check it.",
  "frontend/src/hooks/useActor.ts": "Hook to create and manage the backend actor based on identity and refresh dependent queries.",
  "frontend/src/hooks/useActorInitTimeout.ts": "Tracks actor fetch duration and returns true if it exceeds 15 seconds.",
  "frontend/src/hooks/useAdminModeration.ts": "Defines a mutation placeholder for setting user verification state and invalidates profile queries.",
  "frontend/src/hooks/useAppIdeas.ts": "Provides stub hooks for app ideas and idea submission, both unimplemented.",
  "frontend/src/hooks/useBackendErrorToast.ts": "Wraps toast notifications to display formatted backend errors or success messages.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller's effective role using the actor and identity, with super-admin override logic.",
  "frontend/src/hooks/useFeatureFlags.ts": "Fetches and updates backend feature flags with error formatting and query invalidation.",
  "frontend/src/hooks/useFollowRequests.ts": "Stub hooks for follow request fetching and actions; all backend methods are missing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, authentication state, and login/logout handling via AuthClient.",
  "frontend/src/hooks/useMessages.ts": "Implements placeholder messaging hooks; all backend message methods throw errors and trigger query invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Stub hooks for notifications; fetching disabled and mutation throws due to missing backend support.",
  "frontend/src/hooks/usePostImageSrc.ts": "Converts an ExternalBlob to a safe image URL with validation, fallbacks, and cleanup.",
  "frontend/src/hooks/usePosts.ts": "Defines post-related hooks, all dependent on missing backend methods and wired to invalidate related queries.",
  "frontend/src/hooks/useProfiles.ts": "React Query hooks for fetching and mutating user profile data, though create and update operations are stubbed with missing backend methods.",
  "frontend/src/hooks/useSocialGraph.ts": "Hooks to fetch followers/following and perform follow actions, all currently stubbed due to missing backend methods.",
  "frontend/src/hooks/useStories.ts": "Story-related query and mutation hooks including fetching, creating, and liking stories, mostly placeholders due to absent backend endpoints.",
  "frontend/src/hooks/useSupport.ts": "Support issue submission, retrieval, and status update hooks, all failing due to unimplemented backend methods.",
  "frontend/src/hooks/useThemePreference.ts": "Manages light/dark theme preference with localStorage syncing and DOM class updates.",
  "frontend/src/hooks/useUserModerationActions.ts": "Provides mutation hooks for blocking, unblocking, and changing user roles via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light/dark themes along with small animation utilities.",
  "frontend/src/main.tsx": "Application entry mounting React, setting up QueryClient and Internet Identity provider.",
  "frontend/src/pages/AdminPortalPage.tsx": "Admin moderation portal with tabbed panels for users, posts, features, and support management.",
  "frontend/src/pages/ConversationPage.tsx": "Handles creating or loading a conversation with a peer, displays messages with auto‑scroll, and allows sending new messages with error handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Provides a form to create a post with caption and optional image, including validation, preview handling, and blocked‑user restrictions.",
  "frontend/src/pages/ExplorePage.tsx": "Implements user search by username and shows recent posts along with profile previews for matched users.",
  "frontend/src/pages/FollowersFollowingPage.tsx": "Displays either the followers or following list for a user, including loading states, error states, and navigation to profiles.",
  "frontend/src/pages/HomeFeedPage.tsx": "Loads and displays the home feed with stories, posts, and error or empty‑state handling.",
  "frontend/src/pages/MessagesPage.tsx": "Shows the user’s conversation list with last messages and unread counts, with navigation into individual conversations.",
  "frontend/src/pages/NotificationsPage.tsx": "Renders the notifications list, handles loading/error states, unread counts, and marking notifications as read, including follow request display.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a single post with likes, comments, image loading, and interactions such as liking, commenting, and sharing.",
  "frontend/src/pages/ProfilePage.tsx": "Shows a user's profile with posts, followers, role-based UI, and actions like following, messaging, and editing when applicable.",
  "frontend/src/pages/SettingsPage.tsx": "Provides user settings including theme selection, logout, support navigation, and app info display.",
  "frontend/src/pages/SupportPage.tsx": "Allows users to submit support issues with category selection, validation, and success/error handling.",
  "frontend/src/types/missing-backend-types.ts": "Defines TypeScript types for backend models such as posts, comments, stories, notifications, and support issues.",
  "frontend/src/utils/formatBackendError.ts": "Maps backend and IC agent error messages to user-friendly strings with fallbacks for unknown cases.",
  "frontend/src/utils/postImage.ts": "Provides helpers to convert image byte data to blob URLs, revoke them, and turn File objects into Uint8Array for uploads.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and handling hash-based routing.",
  "frontend/src/utils/verifiedBadge.ts": "Determines which badge color to show for a user based on role, super-admin status, and verification state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, animations, and container settings for the project.",
  "project_state.json": "Project state file describing app goals, architecture notes, known issues, and feature requirements for ongoing development."
}