{
  "kind": "build_request",
  "title": "Retry the failed build and production deployment",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-106",
      "text": "Retry the full build and production deployment for the current Instabook codebase, and if the build/deploy fails again, diagnose the reported deployment error and apply the minimal necessary code changes to make deployment succeed without breaking existing app flows.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Retry"
        ]
      },
      "acceptanceCriteria": [
        "A full build completes successfully (frontend TypeScript compile + backend Motoko compile) with no unresolved errors.",
        "Production deployment completes successfully with no deployment error.",
        "If any changes are required to make deployment succeed, they are minimal and do not break existing core flows: login, home feed load, profile navigation, create post/story, admin portal access (for authorized roles).",
        "Any user-facing error text introduced/updated as part of the fix is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with logic in backend/main.mo; only add backend/migration.mo changes if an upgrade requires it (conditional migration policy).",
    "Do not edit frontend files under immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Frontend must continue to surface backend failures with clear, user-visible English error messages (no silent failures or indefinite loading states)."
  ],
  "nonGoals": [
    "Do not add new product features unrelated to unblocking build/deployment.",
    "Do not introduce new backend services, databases, or third-party auth providers (Internet Identity only).",
    "Do not change the app’s information architecture or navigation beyond what is required to fix the build/deployment failure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}