{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Instabook frontend build/deploy unblock (minimal fix pass)",
  "requirements": [
    {
      "id": "REQ-106",
      "summary": "Unblock build/deployment by addressing frontend TypeScript and runtime integration issues with the existing backend actor while preserving current app flows and English error handling.",
      "acceptanceCriteria": [
        "A full build completes successfully (frontend TypeScript compile + backend Motoko compile) with no unresolved errors.",
        "Production deployment completes successfully with no deployment error.",
        "If any changes are required to make deployment succeed, they are minimal and do not break existing core flows: login, home feed load, profile navigation, create post/story, admin portal access (for authorized roles).",
        "Any user-facing error text introduced/updated as part of the fix is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config.ts",
          "operation": "create",
          "description": "Add the missing frontend backend-connection module expected by existing imports (e.g., createActorWithConfig) to restore TypeScript build success and preserve current actor creation behavior. Use the core-infrastructure component patterns for backend connection configuration. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/types/backend-actor-augmentations.d.ts",
          "operation": "create",
          "description": "Add a TypeScript declaration augmentation to include any backend actor initialization helpers referenced by immutable hooks (e.g., the access control secret initialization method) so the frontend TypeScript build succeeds without modifying immutable files. This aligns with the authorization component’s frontend integration expectations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/formatBackendError.ts",
          "operation": "modify",
          "description": "Harden error-message normalization for common build/deploy/runtime failures (agent/replica errors, rejected calls, initialization failures) to ensure user-visible English errors and avoid leaking confusing internal messages during deployment-related issues."
        },
        {
          "path": "frontend/src/components/auth/RequireAuth.tsx",
          "operation": "modify",
          "description": "Ensure the authentication gate continues to avoid silent failures/indefinite loading by consistently presenting clear English recovery actions/messages for actor/profile initialization failures (reusing existing formatting utilities) while keeping login/profile-setup flows intact."
        }
      ]
    }
  ]
}