{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Wire profile React Query hooks to real backend actor methods and update frontend declarations",
  "requirements": [
    {
      "id": "REQ-81",
      "summary": "Replace stubbed profile hooks with real backend actor calls and ensure formatted errors surface to the UI.",
      "acceptanceCriteria": [
        "`useGetCallerProfile` no longer throws the hardcoded error “getCallerUserProfile method not available in backend interface” and instead calls the backend actor method.",
        "On a fresh account with no profile, the app renders the existing “Complete Your Profile” setup UI (not an error screen).",
        "On an account with an existing profile, the app loads into authenticated pages without showing “Failed to Load Profile”.",
        "If the backend traps/returns an error, the UI shows a clear English error message coming from `formatBackendError` (e.g., in the RequireAuth error UI or relevant page alerts)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useProfiles.ts",
          "operation": "modify",
          "description": "Remove all stubbed/throwing profile calls and wire React Query hooks to the backend actor methods: useGetCallerProfile -> actor.getCallerUserProfile(); useGetProfileById -> actor.getProfileByPrincipal(id); useGetProfileByUsername -> actor.getProfileByUsername(username); useCreateProfile -> actor.createUserProfile(...); useUpdateProfile -> actor.updateCallerUserProfile(...). Ensure all failures are caught and rethrown as new Error(formatBackendError(error)) so RequireAuth/Profile pages show clear English errors (no silent failures). Also ensure query keys/invalidation keep currentUserProfile and viewed profile caches consistent after mutations."
        },
        {
          "path": "frontend/src/components/auth/RequireAuth.tsx",
          "operation": "modify",
          "description": "Adjust profile-loading guard logic only as needed to align with the updated useGetCallerProfile behavior (null profile should route to the existing ProfileSetupDialog; backend errors should continue to display the existing “Failed to Load Profile” UI using the hook error message). Keep all user-facing text in English."
        }
      ]
    },
    {
      "id": "REQ-82",
      "summary": "Update frontend backend declarations/types so new profile actor methods are available to TypeScript and runtime calls resolve correctly.",
      "acceptanceCriteria": [
        "The frontend builds without TypeScript errors related to missing actor methods.",
        "At runtime, calls to the new profile methods do not produce “method not found” errors.",
        "A production build/deployment includes the updated canister interface and matching frontend declarations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the declared backend interface type used by useActor()/actor calls to include the newly added profile methods required by the existing UI: createUserProfile(...) and updateCallerUserProfile(...), matching the canister interface names/signatures used by frontend hooks. Ensure getCallerUserProfile/getProfileByPrincipal/getProfileByUsername remain correctly typed as returning PublicUserProfile | null."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Align imports/types with the updated generated backend declarations (e.g., prefer ProfileVisibility/UserRole types from the backend declarations where used) and remove any now-unused imports introduced by the profile hook/type updates to keep TypeScript compilation clean."
        },
        {
          "path": "frontend/src/components/profile/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Ensure the create-profile flow remains compatible with the updated useCreateProfile hook signature/types sourced from the backend declarations (no runtime behavior change; keep English UI text)."
        },
        {
          "path": "frontend/src/components/profile/EditProfileDialog.tsx",
          "operation": "modify",
          "description": "Ensure the edit-profile flow remains compatible with the updated useUpdateProfile hook signature/types sourced from the backend declarations (no runtime behavior change; keep English UI text and continue surfacing formatted backend errors)."
        }
      ]
    }
  ]
}